docs/agent-components/agent-components.gv
// Agent components
digraph G {
	graph [label="Agent Components" nodesep=0.8 splines=ortho]
	subgraph workflow {
		node [color=white style=filled]
		color=grey style=filled
		A [label="User Request" shape=box]
		label=User
	}
	subgraph agent {
		node [color=green style=filled]
		color=grey style=filled
		B [label="Agent Core" shape=box]
		label="Agent Core"
	}
	subgraph memory {
		node [color=green style=filled]
		color=grey style=filled
		C [label="Memory Module" shape=box]
		label="Memory Module"
	}
	subgraph tools {
		node [color=green style=filled]
		color=grey style=filled
		D [label=Tools shape=box]
		label=Tools
	}
	subgraph planning {
		node [color=green style=filled]
		color=grey style=filled
		E [label="Planning Module" shape=box]
		label="Planning Module"
	}
	A -> B
	B -> C
	B -> D
	B -> E
}
